# using Arithmetic Operations

In [1]:
import pandas as pd

In [2]:
var=pd.DataFrame({'py':[1,2,3,4,5],'ipyk':[6,7,8,9,10]})
var

   py  ipyk
0   1     6
1   2     7
2   3     8
3   4     9
4   5    10

# Addition

In [3]:
var['A']=var['py']+var['ipyk']
var

   py  ipyk   A
0   1     6   7
1   2     7   9
2   3     8  11
3   4     9  13
4   5    10  15

# Subtaction

In [4]:
var['B']= var['py']-var['ipyk']
var

   py  ipyk   A  B
0   1     6   7 -5
1   2     7   9 -5
2   3     8  11 -5
3   4     9  13 -5
4   5    10  15 -5

# Division

In [5]:
var['C']=var['py']/var['ipyk']
var

   py  ipyk   A  B         C
0   1     6   7 -5  0.166667
1   2     7   9 -5  0.285714
2   3     8  11 -5  0.375000
3   4     9  13 -5  0.444444
4   5    10  15 -5  0.500000

# Comparision Operator

In [6]:
var['D']=var['ipyk']>=7
var

   py  ipyk   A  B         C      D
0   1     6   7 -5  0.166667  False
1   2     7   9 -5  0.285714   True
2   3     8  11 -5  0.375000   True
3   4     9  13 -5  0.444444   True
4   5    10  15 -5  0.500000   True

# Insert and Delete in Pandas

In [7]:
import pandas as pr
var1 = pr.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8]})
var1

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

# Insert new value

In [8]:
var1.insert(2,'c',[9,10,11,12])
var1

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

# Insert the value of another column

In [9]:
var1.insert(3,'d',var1['a'])
var1

   a  b   c  d
0  1  5   9  1
1  2  6  10  2
2  3  7  11  3
3  4  8  12  4

# Add only few values using slicing

In [10]:
var1['e']=var1['b'][:3]
var1

   a  b   c  d    e
0  1  5   9  1  5.0
1  2  6  10  2  6.0
2  3  7  11  3  7.0
3  4  8  12  4  NaN

# Delete Column using del

In [13]:
del var1['e']
var1

   a  b   c  d
0  1  5   9  1
1  2  6  10  2
2  3  7  11  3
3  4  8  12  4

# Delete column using pop

In [14]:
var1.pop('d')
var1

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12